n1 = {
    'SA-SM': 'Великобритания',
    'SN-ST': 'Германия',
    'SU-SZ': 'Польша',
    'S1-S4': 'Латвия',
    'TA-TH': 'Швейцария',
    'TJ-TP': 'Чехия',
    'TR-TV': 'Венгрия',
    'TW-T1': 'Португалия',
    'UH-UM': 'Дания',
    'UN-UT': 'Ирландия',
    'UU-UZ': 'Румыния',
    'U5-U7': 'Словакия',
    'VA-VE': 'Австрия',
    'VF-VR': 'Франция',
    'VS-VW': 'Испания',
    'VX-V2': 'Сербия',
    'V3-V5': 'Хорватия',
    'V6-V0': 'Эстония',
    'XA-XE': 'Болгария',
    'XF-XK': 'Греция',
    'XL-XR': 'Нидерланды',
    'XS-XW': 'Россия',
    'XX-X2': 'Люксембург',
    'X3-X0': 'Россия',
    'YA-YE': 'Бельгия',
    'YF-YK': 'Финляндия',
    'YL-YR': 'Мальта',
    'YS-YW': 'Швеция',
    'YX-Y2': 'Норвегия',
    'Y3-Y5': 'Беларусь',
    'Y6-Y0': 'Украина',
    'ZA-ZR': 'Италия',
    'ZX-Z2': 'Словения',
    'Z3-Z5': 'Литва',
    'Z9-Z9': 'Россия', #???
    'JA-JT': 'Япония',
    'KA-KE': 'Шри-Ланка',
    'KF-KK': 'Израиль',
    'KL-KR': 'Южная Корея',
    'KS-K0': 'Казахстан',
    'LA-L0': 'Китай',
    'MA-ME': 'Индия',
    'MF-MK': 'Индонезия',
    'ML-MR': 'Таиланд',
    'MS-M0': 'Мьянма',
    'NA-NE': 'Иран',
    'NF-NK': 'Пакистан',
    'NL-NR': 'Турция',
    'PA-PE': 'Филиппины',
    'PF-PK': 'Сингапур',
    'PL-PR': 'Малайзия',
    'RA-RE': 'Объединенные Арабские Эмираты',
    'RF-RK': 'Тайвань',
    'RL-RR': 'Вьетнам',
    'RS-R0': 'Саудовская Аравия',
    '1A-10': 'США',
    '4A-40': 'США',
    '5A-50': 'США',
    '2A-20': 'Канада',
    '3A-3W': 'Мексика',
    '3X-37': 'Коста-Рика',
    '38-39': 'Каймановы Острова',
    '8A-8E': 'Аргентина',
    '8F-8K': 'Чили',
    '8L-8R': 'Эквадор',
    '8S-8W': 'Перу',
    '8X-82': 'Венесуэла',
    '9A-9E': 'Бразилия',
    '9F-9K': 'Колумбия',
    '9L-9R': 'Парагвай',
    '9S-9W': 'Уругвай',
    '9X-92': 'Тринидад И Тобаго',
    '93–99': 'Бразилия'
}

n1_2 = {
    '1': 'США',
    '4': 'США',
    '5': 'США',
    '2': 'Канада',
    '3': 'Мексика',
    '9': 'Бразилия',
    'J': 'Япония',
    'К': 'Корея',
    'Y': 'Швеция',
    'S': 'Англия',
    'V': 'Испания',
    'W': 'Германия',
    'Z': 'Италия'
}

alphabet = 'ABCDEFGHJKLMNPRSTUVWXYZ1234567890' # I, O, Q - не используются


# пределяем страну по первому симолу
def rez_num_1(info, vin):
    num_1 = {}
    for i_num, i_reg in n1.items():
        i_1 = i_num[0]
        i_2 = alphabet.index(i_num[1])
        i_3 = alphabet.index(i_num[4])
        for i in alphabet[i_2:i_3 + 1]:
            num_1[f'{i_1}{i}'] = i_reg
    if num_1.get(vin[:2]):
        info['Страна'] = num_1.get(vin[:2])
    else:
        info['Страна'] = n1_2.get(vin[0])
