number = {
    'A': 1,
    'J': 1,
    'B': 2,
    'K': 2,
    'S': 2,
    'C': 3,
    'L': 3,
    'T': 3,
    'D': 4,
    'M': 4,
    'U': 4,
    'E': 5,
    'N': 5,
    'V': 5,
    'F': 6,
    'W': 6,
    'G': 7,
    'P': 7,
    'X': 7,
    'H': 8,
    'Y': 8,
    'R': 9,
    'Z': 9,
    '1': 1,
    '2': 2,
    '3': 3,
    '4': 4,
    '5': 5,
    '6': 6,
    '7': 7,
    '8': 8,
    '9': 9,
    '0': 0
}

weigth = {
    1: 8,
    2: 7,
    3: 6,
    4: 5,
    5: 4,
    6: 3,
    7: 2,
    8: 10,
    9: 0, #(контрольный символ в расчете участия не принимает)
    10: 9,
    11: 8,
    12: 7,
    13: 6,
    14: 5,
    15: 4,
    16: 3,
    17: 2
}

alphabet = 'ABCDEFGHJKLMNPRSTUVWXYZ1234567890' # I, O, Q - не используются


# Вычисление контрольной суммы и проверка символов ВИН кода
def rez_crc(info, vin):
    sum_vin = 0
    for i_num, i_leter in enumerate(vin):
        if i_leter not in alphabet:
            info['Проверка контрольной суммы'] = f'Недопустимый символ ({i_leter})'
            return
        sum_vin += number[i_leter] * weigth[i_num + 1]
    sum_vin = sum_vin % 11
    if vin[8] == 'X' and sum_vin % 11 == 10:
        info['Проверка контрольной суммы'] = 'НЕ пройдена!'
        return
    try:
        if sum_vin % 11 == int(vin[8]):
            info['Проверка контрольной суммы'] = 'Пройдена!'
            return
    except:
        info['Проверка контрольной суммы'] = 'ОШИБКА VIN (неверный контрольный символ)!'
        return
    info['Проверка контрольной суммы'] = 'ОШИБКА контрольной суммы!!!'
